src/Reports/ДействующиеРетроБонусыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ДействующиеРетроБонусыКлиента</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСПоСтавкам4и2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМеждународное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВТранскрипции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СокращенноеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/ДействующиеРетроБонусыКлиента/Ext/ObjectModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// При компоновке результата.
// 
// Параметры:
//  ДокументРезультат - ТабличныйДокумент - Документ результат
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных - Данные расшифровки
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ПараметрВариантОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ВариантОтчета");
	ПараметрПартнер = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "Партнер");
	ПараметрКонтрагент = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "Контрагент");
	ПараметрДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ДатаОтчета");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПараметрДатаОтчета", ПараметрДатаОтчета);
	СтруктураПараметров.Вставить("ПараметрВариантОтчета", ПараметрВариантОтчета);
	СтруктураПараметров.Вставить("ПараметрПартнер", ПараметрПартнер);
	СтруктураПараметров.Вставить("ПараметрКонтрагент", ПараметрКонтрагент);
	
	УстановитьДополнительныеПараметры(НастройкиОтчета, СтруктураПараметров);
	УстановитьЗаголовокОтчета(НастройкиОтчета, СтруктураПараметров);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ОтчетПустой = ОтчетыСервер.ОтчетПустой(ЭтотОбъект, ПроцессорКомпоновки);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетПустой", ОтчетПустой);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - См. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт 
	
	Если КлючВарианта = "ДействующиеРетроБонусыПоКлиентуКонтекст"
	 ИЛИ КлючВарианта = "ДействующиеРетроБонусыПоКонтрагентуКонтекст" Тогда
		
		Настройки.ФормироватьСразу = Истина;
		Настройки.РазрешеноИзменятьВарианты = Ложь;
		
	КонецЕсли;
	
	Настройки.События.ПриСозданииНаСервере = Истина; 
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриСозданииНаСервере
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = Форма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		ПараметрКоманды = Параметры.ПараметрКоманды; // СправочникСсылка.Партнеры, СправочникСсылка.Контрагенты
		ТипПараметраКоманды = ТипЗнч(ПараметрКоманды);
		
		Форма.НастройкиОтчета.РазрешеноВыбиратьВарианты = Ложь;
		
		Если ТипПараметраКоманды = Тип("СправочникСсылка.Партнеры") Тогда
			
			ПартнерКлиент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Клиент");
			Если НЕ ПартнерКлиент Тогда
				
				ТекстСообщения = НСтр("ru = 'Формирование отчета предусмотрено только для клиентов'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - См. ОбщаяФорма.ФормаОтчета
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже).
//       Может не использоваться, если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено, когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда пользовательские настройки не надо загружать (уже загружены ранее).
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы = КлючВарианта Тогда
		Возврат;
	КонецЕсли;
	
	Если НовыеНастройкиКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Параметры = Контекст.Параметры;
		Если Параметры.Свойство("ПараметрКоманды") Тогда
			
			ПараметрКоманды = Параметры.ПараметрКоманды; // СправочникСсылка.Партнеры, СправочникСсылка.Контрагенты
			ЗаполнитьПараметрыПоКонтексту(ПараметрКоманды, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД);
			
		КонецЕсли;
		
		ПараметрВариантОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НовыеНастройкиКД, "ВариантОтчета");
		ВариантОтчета = ПараметрВариантОтчета.Значение;
		УстановитьДоступностьПараметровДляВариантаОтчета(ВариантОтчета, СхемаКомпоновкиДанных);
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда 
		
			ПараметрОрганизация = СхемаКомпоновкиДанных.Параметры.Найти("Организация");
			
			ПараметрОрганизация.ОграничениеИспользования = Истина;
			ПараметрОрганизация.Использование = ИспользованиеПараметраКомпоновкиДанных.Авто;
			ПараметрОрганизация.ЗапрещатьНезаполненныеЗначения = Ложь;
			
			ОрганизациюПоУмолчанию = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию();
			
			Если ЗначениеЗаполнено(ОрганизациюПоУмолчанию) Тогда
				
				КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
					НовыеНастройкиКД,
					"Организация", 
					ОрганизациюПоУмолчанию);
				
				Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
					
					КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
						НовыеПользовательскиеНастройкиКД,
						"Организация", 
						ОрганизациюПоУмолчанию);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
		Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
			
			ПараметрДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(
				НовыеПользовательскиеНастройкиКД,
				"ДатаОтчета");
			
			Если НЕ ЗначениеЗаполнено(ПараметрДатаОтчета.Значение) Тогда
				
				ПараметрДата = ПараметрДатаОтчета.Значение; // СтандартнаяДатаНачала, Дата
				Если ТипЗнч(ПараметрДата) = Тип("СтандартнаяДатаНачала") Тогда
					
					ПараметрДата.Дата = НачалоДня(ТекущаяДатаСеанса());
					ПараметрДата.Вариант = ВариантСтандартнойДатыНачала.НачалоЭтогоДня;
					
				Иначе
					
					ПараметрДата = НачалоДня(ТекущаяДатаСеанса());
					
				КонецЕсли;
				
				КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
					НовыеПользовательскиеНастройкиКД,
					"ДатаОтчета", 
					ПараметрДата);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КлючСхемы = КлючВарианта;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьДоступностьПараметровДляВариантаОтчета(ВариантОтчета, СхемаКомпоновкиДанных)
	
	ПараметрПартнер = СхемаКомпоновкиДанных.Параметры.Найти("Партнер");
	ПараметрКонтрагент = СхемаКомпоновкиДанных.Параметры.Найти("Контрагент");
	
	Если ВариантОтчета = 1 Тогда // по клиенту
		
		ПараметрПартнер.ОграничениеИспользования = Ложь;
		ПараметрПартнер.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрПартнер.ЗапрещатьНезаполненныеЗначения = Истина;
		
		ПараметрКонтрагент.ОграничениеИспользования = Истина;
		ПараметрКонтрагент.Использование = ИспользованиеПараметраКомпоновкиДанных.Авто;
		ПараметрКонтрагент.ЗапрещатьНезаполненныеЗначения = Ложь;
		
	ИначеЕсли ВариантОтчета = 2 Тогда // по контрагенту
		
		ПараметрПартнер.ОграничениеИспользования = Истина;
		ПараметрПартнер.Использование = ИспользованиеПараметраКомпоновкиДанных.Авто;
		ПараметрПартнер.ЗапрещатьНезаполненныеЗначения = Ложь;
		
		ПараметрКонтрагент.ОграничениеИспользования = Ложь;
		ПараметрКонтрагент.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрКонтрагент.ЗапрещатьНезаполненныеЗначения = Истина; 
		
	ИначеЕсли ВариантОтчета = 4 Тогда // по клиенту (контекст)
		
		ПараметрПартнер.ОграничениеИспользования = Истина;
		ПараметрПартнер.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрПартнер.ЗапрещатьНезаполненныеЗначения = Истина;
		
		ПараметрКонтрагент.ОграничениеИспользования = Истина;
		ПараметрКонтрагент.Использование = ИспользованиеПараметраКомпоновкиДанных.Авто;
		ПараметрКонтрагент.ЗапрещатьНезаполненныеЗначения = Ложь;
		
	ИначеЕсли ВариантОтчета = 5 Тогда // по контрагенту (контекст)
		
		ПараметрПартнер.ОграничениеИспользования = Истина;
		ПараметрПартнер.Использование = ИспользованиеПараметраКомпоновкиДанных.Авто;
		ПараметрПартнер.ЗапрещатьНезаполненныеЗначения = Ложь;
		
		ПараметрКонтрагент.ОграничениеИспользования = Истина;
		ПараметрКонтрагент.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрКонтрагент.ЗапрещатьНезаполненныеЗначения = Истина;	
		
	Иначе // по клиенту и контрагенту
		
		ПараметрПартнер.ОграничениеИспользования = Ложь;
		ПараметрПартнер.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрПартнер.ЗапрещатьНезаполненныеЗначения = Истина;
		
		ПараметрКонтрагент.ОграничениеИспользования = Ложь;
		ПараметрКонтрагент.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрКонтрагент.ЗапрещатьНезаполненныеЗначения = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает дополнительные параметры по переданным параметрам.
// 
// Параметры:
//  НастройкиОтчета - НастройкиКомпоновкиДанных - 
//  СтруктураПараметров - Структура:
// * ПараметрПартнер - ЗначениеПараметраКомпоновкиДанных, Неопределено, ЗначениеПараметраНастроекКомпоновкиДанных - Параметр партнер
// * ПараметрКонтрагент - ЗначениеПараметраКомпоновкиДанных, Неопределено, ЗначениеПараметраНастроекКомпоновкиДанных - Параметр контрагент
Процедура УстановитьДополнительныеПараметры(НастройкиОтчета, СтруктураПараметров)
	
	ПараметрПартнер = СтруктураПараметров.ПараметрПартнер;
	ПараметрКонтрагент = СтруктураПараметров.ПараметрКонтрагент;
	
	Если ПараметрКонтрагент <> Неопределено
	   И ЗначениеЗаполнено(ПараметрКонтрагент.Значение) 
	   И ПараметрКонтрагент.Использование Тогда
		
		Контрагент = ПараметрКонтрагент.Значение;  // СправочникСсылка.Контрагенты 
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ИНН,Партнер");
		ИНН = РеквизитыКонтрагента.ИНН;
		ПартнерКонтрагента = РеквизитыКонтрагента.Партнер;
		
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "ИНН", ИНН);
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "ПартнерКонтрагента", ПартнерКонтрагента);
		
	Иначе
		
		ПустаяСсылкаКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "Контрагент", ПустаяСсылкаКонтрагент);
		
	КонецЕсли;
	
	Если ПараметрПартнер <> Неопределено
	   И ЗначениеЗаполнено(ПараметрПартнер.Значение)
	   И ПараметрПартнер.Использование Тогда
		
		Партнер = ПараметрПартнер.Значение;
		КонтрагентыПартнера = Новый СписокЗначений;  // СписокЗначений из СправочникСсылка.Контрагенты
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Партнер", Партнер);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			КонтрагентыПартнера.Добавить(Выборка.Контрагент);
		КонецЦикла;
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "КонтрагентыПартнера", КонтрагентыПартнера);
		
	Иначе
		
		ПустаяСсылкаПартнер = Справочники.Партнеры.ПустаяСсылка();
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "Партнер", ПустаяСсылкаПартнер);
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает заголовок отчета.
// 
// Параметры:
//  НастройкиОтчета - НастройкиКомпоновкиДанных - Настройки отчета
//  СтруктураПараметров - Структура:
//   * ПараметрДатаОтчета - ЗначениеПараметраКомпоновкиДанных, Неопределено, ЗначениеПараметраНастроекКомпоновкиДанных - Параметр дата отчета
//   * ПараметрВариантОтчета - ЗначениеПараметраКомпоновкиДанных, Неопределено, ЗначениеПараметраНастроекКомпоновкиДанных - Параметр вариант отчета
//   * ПараметрПартнер - ЗначениеПараметраКомпоновкиДанных, Неопределено, ЗначениеПараметраНастроекКомпоновкиДанных - Параметр партнер
//   * ПараметрКонтрагент - ЗначениеПараметраКомпоновкиДанных, Неопределено, ЗначениеПараметраНастроекКомпоновкиДанных - Параметр контрагент
//
Процедура УстановитьЗаголовокОтчета(НастройкиОтчета, СтруктураПараметров)
	
	ПараметрДатаОтчета = СтруктураПараметров.ПараметрДатаОтчета;
	ПараметрВариантОтчета = СтруктураПараметров.ПараметрВариантОтчета;
	ПараметрПартнер = СтруктураПараметров.ПараметрПартнер;
	ПараметрКонтрагент = СтруктураПараметров.ПараметрКонтрагент;
	
	ПараметрДата = ПараметрДатаОтчета.Значение;  // СтандартнаяДатаНачала, Дата
	Если ТипЗнч(ПараметрДата) = Тип("СтандартнаяДатаНачала") Тогда
		ДатаОтчета = ПараметрДата.Дата;
	Иначе
		ДатаОтчета = ПараметрДата;
	КонецЕсли;
	ДатаОтчетаСтрокой = Формат(ДатаОтчета, "ДЛФ=D");
	
	Если ПараметрВариантОтчета <> Неопределено
	   И ЗначениеЗаполнено(ПараметрВариантОтчета.Значение) Тогда
		
		ЗаголовокОтчета = "";
		ВариантОтчета = ПараметрВариантОтчета.Значение;
		Если ВариантОтчета = 4 Тогда
			
			Если ПараметрПартнер <> Неопределено
			   И ЗначениеЗаполнено(ПараметрПартнер.Значение) Тогда
				
				ПартнерСтрокой = Строка(ПараметрПартнер.Значение);
				Шаблон = НСтр("ru = 'Действующие ретро-бонусы по клиенту ""%1"" на дату %2'");
				ЗаголовокОтчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон,
					ПартнерСтрокой, 
					ДатаОтчетаСтрокой);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВариантОтчета = 5 Тогда
			
			Если ПараметрКонтрагент <> Неопределено
			   И ЗначениеЗаполнено(ПараметрКонтрагент.Значение) Тогда
			   
				КонтрагентСтрокой = Строка(ПараметрКонтрагент.Значение);
				Шаблон = НСтр("ru = 'Действующие ретро-бонусы по контрагенту ""%1"" на дату %2'");
				ЗаголовокОтчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон,
					КонтрагентСтрокой, 
					ДатаОтчетаСтрокой);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ЗаголовокОтчета) Тогда
			КомпоновкаДанныхКлиентСервер.УстановитьПараметрВывода(НастройкиОтчета, "Заголовок", ЗаголовокОтчета);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет параметры из переданного контекста.
// 
// Параметры:
//  ПараметрКоманды - ЛюбаяСсылка
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда пользовательские настройки не надо загружать (уже загружены ранее).
//
Процедура ЗаполнитьПараметрыПоКонтексту(ПараметрКоманды, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД)
	
	ТипПараметраКоманды = ТипЗнч(ПараметрКоманды);
	
	Если ТипПараметраКоманды = Тип("СправочникСсылка.Партнеры") Тогда
		
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Партнер", ПараметрКоманды);
		Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
			
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
				НовыеПользовательскиеНастройкиКД,
				"Партнер", 
				ПараметрКоманды);
			
		КонецЕсли;
		
	ИначеЕсли ТипПараметраКоманды = Тип("СправочникСсылка.Контрагенты") Тогда
		
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Контрагент", ПараметрКоманды);
		Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
			
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
				НовыеПользовательскиеНастройкиКД, 
				"Контрагент", 
				ПараметрКоманды);
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
